declare enum JRoundingMode {
    /**
     * 向正无穷方向对齐
     */
    UP = 0,
    /**
     * 向负无穷方向对齐
     */
    DOWN = 1,
    /**
     * 向原点的反方向对齐
     */
    CEILING = 2,
    /**
     * 向原点方向对齐
     */
    FLOOR = 3,
    /**
     * “四舍五入”，如果舍弃部分的最高位大于等于 5，向正无穷方向对齐，否则向负无穷方向对齐
     */
    HALF_UP = 4,
    /**
     * 五舍六入”，如果舍弃部分的最高位大于 5，向正无穷方向对齐，否则向负无穷方向对齐
     */
    HALF_DOWN = 5,
    /**
     * “四舍六入五成双”，如果舍弃部分的最高位大于等于六，或等于五并且前一位是奇数，向正无穷方向对齐，否则向负无穷方向对齐
     */
    HALF_EVEN = 6,
    /**
     * 如果需要舍入，就抛出算术异常
     */
    UNNECESSARY = 7,
}